In [1]:
import pandas as pd 
import numpy as np

In [2]:
date=pd.read_csv(r"https://raw.githubusercontent.com/campusx-official/100-days-of-machine-learning/main/day34-handling-date-and-time/orders.csv")
time=pd.read_csv(r"https://raw.githubusercontent.com/campusx-official/100-days-of-machine-learning/main/day34-handling-date-and-time/messages.csv")

## first thing to do in data time dataset is to convert the date time columns to date

In [7]:
date["date"]=pd.to_datetime(date["date"])

In [67]:
time["date"]=pd.to_datetime(time["date"])
time.drop(columns="msg",inplace=True)

In [35]:
date.drop(columns=["product_id","city_id","orders"],inplace=True)

## working on date of date datasets

### Extract Year

In [36]:
date["date_year"]=date["date"].dt.year
date.sample(2)

,date,date_year,date_month_no,date_month_name,date_day,date_day_of_week,date_day_of_week_name
102,2018-08-30,2018,8,August,30,3,Thursday
571,2018-09-18,2018,9,September,18,1,Tuesday

### Extract Month

In [37]:
date["date_month_no"]=date["date"].dt.month
date.sample(2)

,date,date_year,date_month_no,date_month_name,date_day,date_day_of_week,date_day_of_week_name
92,2019-05-30,2019,5,May,30,3,Thursday
865,2018-10-13,2018,10,October,13,5,Saturday

### Extract Month Name

In [38]:
date["date_month_name"]=date["date"].dt.month_name()
date.sample(2)

,date,date_year,date_month_no,date_month_name,date_day,date_day_of_week,date_day_of_week_name
461,2019-10-20,2019,10,October,20,6,Sunday
160,2019-11-28,2019,11,November,28,3,Thursday

### Extract Days

In [39]:
date["date_day"]=date["date"].dt.day
date.sample(2)

,date,date_year,date_month_no,date_month_name,date_day,date_day_of_week,date_day_of_week_name
764,2019-07-26,2019,7,July,26,4,Friday
750,2018-09-18,2018,9,September,18,1,Tuesday

### Extract Days of which week

In [40]:
date["date_day_of_week"]=date["date"].dt.dayofweek
date.sample(2)

,date,date_year,date_month_no,date_month_name,date_day,date_day_of_week,date_day_of_week_name
366,2019-07-22,2019,7,July,22,0,Monday
1,2018-08-15,2018,8,August,15,2,Wednesday

### Extract Day of Week Name

In [41]:
date["date_day_of_week_name"]=date["date"].dt.day_name()
date.sample(2)

,date,date_year,date_month_no,date_month_name,date_day,date_day_of_week,date_day_of_week_name
414,2018-11-20,2018,11,November,20,1,Tuesday
642,2018-08-21,2018,8,August,21,1,Tuesday

### Is that day a weekend or not

In [45]:
date["date_is_weekend"]=np.where(date["date_day_of_week_name"].isin(["Sunday","Saturday"]),1,0)
date.sample(2)

,date,date_year,date_month_no,date_month_name,date_day,date_day_of_week,date_day_of_week_name,date_is_weekend
83,2018-08-11,2018,8,August,11,5,Saturday,1
204,2018-10-07,2018,10,October,7,6,Sunday,1

### Extract week of the year

In [51]:
date["date_week_of_year"]=date["date"].dt.isocalendar().week
date.sample(2)

,date,date_year,date_month_no,date_month_name,date_day,date_day_of_week,date_day_of_week_name,date_is_weekend,date_week_of_year
359,2019-03-23,2019,3,March,23,5,Saturday,1,12
7,2019-03-27,2019,3,March,27,2,Wednesday,0,13

### Extract Quarter

In [53]:
date["date_quarter"]=date["date"].dt.quarter
date.sample(2)

,date,date_year,date_month_no,date_month_name,date_day,date_day_of_week,date_day_of_week_name,date_is_weekend,date_week_of_year,date_quarter
701,2018-11-25,2018,11,November,25,6,Sunday,1,47,4
516,2018-12-09,2018,12,December,9,6,Sunday,1,49,4

### Extract Semester

In [59]:
date["semester"]=np.where(date["date_quarter"].isin([1,2]),1,2)
date.sample(2)

,date,date_year,date_month_no,date_month_name,date_day,date_day_of_week,date_day_of_week_name,date_is_weekend,date_week_of_year,date_quarter,semester
92,2019-05-30,2019,5,May,30,3,Thursday,0,22,2,1
592,2018-12-05,2018,12,December,5,2,Wednesday,0,49,4,2

### Extract time elapsed between dates

In [61]:
import datetime 

today=datetime.datetime.today()

today

datetime.datetime(2023, 4, 8, 11, 59, 32, 340993)

In [64]:
today-date["date"]

0     1215 days 11:59:32.340993
1     1697 days 11:59:32.340993
2     1628 days 11:59:32.340993
3     1330 days 11:59:32.340993
4     1553 days 11:59:32.340993
                 ...
995   1643 days 11:59:32.340993
996   1584 days 11:59:32.340993
997   1432 days 11:59:32.340993
998   1497 days 11:59:32.340993
999   1271 days 11:59:32.340993
Name: date, Length: 1000, dtype: timedelta64[ns]

# Time dataset

### Extract Hour

In [71]:
time["hour"]=time["date"].dt.hour
time.sample(2)

                   date  hour
169 2014-05-19 23:07:00    23
367 2012-06-17 23:51:00    23

### Extract Minute

In [72]:
time["minute"]=time["date"].dt.minute
time.sample(2)

                   date  hour  minute
686 2012-08-16 01:02:00     1       2
353 2013-07-27 00:48:00     0      48

### Extract Sec

In [78]:
time["second"]=time["date"].dt.second
time.sample(2)

                   date  hour  minute  second
895 2013-09-03 00:51:00     0      51       0
390 2016-09-15 23:00:00    23       0       0

### Extract time from datetime

In [80]:
time["time"]=time["date"].dt.time
time.sample(2)

                   date  hour  minute  second      time
512 2016-01-15 02:22:00     2      22       0  02:22:00
81  2013-09-23 00:53:00     0      53       0  00:53:00